      //‚get Welcome Message
     denv_getWelcomeMessage...
     d                 pr           100a   varying
      //‚get appli path
     denv_getAppliPath...
     d                 pr            50a   varying
      //‚get client path
     denv_getClientPath...
     d                 pr            50a   varying
      //‚get client journal
     denv_getJournalPath...
     d                 pr            50a   varying
