      //‚Send program message
     d msg_SndPM       pr
     d  pn                           10a   const
     d  mt                          130    const
      //‚Remove all program message
     d msg_RmvPM       pr
     d  pn                           10a   const
      //‚Send message text to user
     d msg_SndM        pr
     D  mi                            7a   const
     D  md                          256a   const varying
